app/controllers/feeds_controller.rb

    def list
        @url = params[:address]

        # Add one of read time in the database
        @feed=Feed.where("source=?",@url)
        if @feed[0].ReadNumber.nil?
            @feed[0].ReadNumber=1
            @feed[0].save
---
SELECT `feeds`.* FROM `feeds` WHERE (source='http://www.ruanyifeng.com/blog/atom.xml')
UPDATE `feeds` SET `ReadNumber` = 1, `updated_at` = '2015-08-12 00:51:11' WHERE `feeds`.`id` = 1

    def search
        keyword=params[:feed][:source]
        counter=0
        @feed=Array.new()
        feedlist=Feed.all
---
SELECT `feeds`.* FROM `feeds`