app/controllers/subscriptions_controller.rb

    def list
        @userid=current_user.id

        # Get subscription list
        @subscriptionslist=Subscription.where("user_id=?",@userid)

        # Set initializaion number
        @counter=-1
        @feedlist=Array.new

        # Add feed info to feedlist
        @subscriptionslist.each do |subscription|
            @counter+=1
            @feedlist[@counter]=Feed.where("id=?",subscription.feed_id)
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE (user_id=1)
SELECT `feeds`.* FROM `feeds` WHERE (id=4)

    def ratelist
        # Order the result by ReadNumber
        @feeds=Feed.order("ReadNumber DESC")

        # Put the 10 most readed feed into the output list
        @feedlist=@feeds.take(10)
---
SELECT  `feeds`.* FROM `feeds`  ORDER BY ReadNumber DESC LIMIT 10